docs/posts/2023-02-06-doom-native-compiler-error.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- May 03, 2026 16:22 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Native Compiler Error</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/posts/rss.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Doom Native Compiler Error</h1>
<p class="subtitle" role="doc-subtitle">Feb 06, 2023 00:00</p>
</header><p>
For those of us who live in Emacs, it&rsquo;s always a bad feeling when Emacs won&rsquo;t start, which happened to me today after upgrading my office Mac. I ran <code>doom doctor</code> which ran through a few checks and stopped with 
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>There was an unexpected runtime error
    Message: Native compiler error
    Details: <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>lambda <span class="org-rainbow-delimiters-depth-3">(</span>arg106 &amp;optional arg107 arg108<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span>let <span class="org-rainbow-delimiters-depth-4">(</span>...<span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-rainbow-delimiters-depth-4">(</span>funcall f arg106 arg107 arg108<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-string">"Compiling /Users/rlridenour/.emacs.d/.local/cache/eln/28.2-75f7b60d/subr--trampoline-72657175697265_require_0.eln...\nxcrun: error: invalid active developer path (/Library/Developer/CommandLineTools), missing xcrun at: /Library/Developer/CommandLineTools/usr/bin/xcrun\nlibgccjit.so</span>
</code></pre>
</div>

<p>
followed by a bunch of incomprehensible (to me) nonsense. The important part being
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>invalid active developer path <span class="org-rainbow-delimiters-depth-1">(</span>/Library/Developer/CommandLineTools<span class="org-rainbow-delimiters-depth-1">)</span>
</code></pre>
</div>

<p>
I always forget that upgrading the OS usually necessitates upgrading the Command Line Developer Tools, so 
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>xcode-select --install
</code></pre>
</div>

<p>
fixed everything.
</p>


<div class="tagline" id="org317ea5f">
<p>
Tagged: <a href="../tags/emacs.html">Emacs</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2026 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on May 03, 2026 16:22.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 10.0-pre).
</div>
</footer>
</body>
</html>
